<p style="text-align:center;font-size:2em;">Exploratory Data Analysis</p>

In [4]:
import pandas as pd
pd.__version__

'2.2.3'

In [5]:
emp = pd.read_excel("Rawdata.xlsx")
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [34]:
df = pd.read_excel("Rawdata.xlsx")
empc = df.copy()

In [6]:
id(emp)

2972283991296

In [8]:
emp.shape

(6, 6)

In [10]:
emp.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [11]:
emp.head()

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year

In [12]:
emp.tail()

     Name          Domain     Age   Location   Salary      Exp
1  Teddy^         Testing  45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#     NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics     NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67-yr        NaN   30000-  5+ year
5     Kim             NLP    55yr      Delhi  6000^$0      10+

In [13]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [16]:
emp.isna().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [19]:
emp.isnull()

    Name  Domain    Age  Location  Salary    Exp
0  False   False  False     False   False  False
1  False   False  False     False   False  False
2  False   False   True      True   False  False
3  False   False   True     False   False   True
4  False   False  False      True   False  False
5  False   False  False     False   False  False

In [22]:
emp[[emp.isnull()]]

ValueError: Index data must be 1-dimensional

In [23]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [24]:
emp["Name"]

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [ ]:
# "\W" means all non word characters

emp["Name"] = emp["Name"].str.replace(r'\W','',regex = True)
emp

    Name          Domain       Age   Location   Salary      Exp
0   Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy         Testing    45' yr  Bangalore  10%%000       <3
2   Umar  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3   Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam      Statistics     67-yr        NaN   30000-  5+ year
5    Kim             NLP      55yr      Delhi  6000^$0      10+

In [ ]:
emp["Domain"] = emp["Domain"].str.replace(r'\W','',regex = True)
emp

    Name       Domain       Age   Location   Salary      Exp
0   Mike  Datascience  34 years     Mumbai   5^00#0       2+
1  Teddy      Testing    45' yr  Bangalore  10%%000       <3
2   Umar  Dataanalyst       NaN        NaN  1$5%000   4> yrs
3   Jane    Analytics       NaN   Hyderbad   2000^0      NaN
4  Uttam   Statistics     67-yr        NaN   30000-  5+ year
5    Kim          NLP      55yr      Delhi  6000^$0      10+

In [ ]:
emp["Age"] = emp["Age"].str.replace(r'\D','',regex = True)
emp

    Name       Domain  Age   Location   Salary      Exp
0   Mike  Datascience   34     Mumbai   5^00#0       2+
1  Teddy      Testing   45  Bangalore  10%%000       <3
2   Umar  Dataanalyst  NaN        NaN  1$5%000   4> yrs
3   Jane    Analytics  NaN   Hyderbad   2000^0      NaN
4  Uttam   Statistics   67        NaN   30000-  5+ year
5    Kim          NLP   55      Delhi  6000^$0      10+

In [31]:
emp["Salary"] = emp["Salary"].str.replace(r'\D','',regex = True)
emp

    Name       Domain  Age   Location Salary      Exp
0   Mike  Datascience   34     Mumbai   5000       2+
1  Teddy      Testing   45  Bangalore  10000       <3
2   Umar  Dataanalyst  NaN        NaN  15000   4> yrs
3   Jane    Analytics  NaN   Hyderbad  20000      NaN
4  Uttam   Statistics   67        NaN  30000  5+ year
5    Kim          NLP   55      Delhi  60000      10+

In [32]:
emp["Exp"] = emp["Exp"].str.replace(r'\D','',regex = True)
emp

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000   10

In [36]:
s = "Dataanalyst^^#"
s.replace(r"\W", '')

'Dataanalyst^^#'

In [37]:
empc

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [38]:
empc["Age"] = emp["Age"].str.extract('(\d+)')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\vineet\AppData\Local\Temp\ipykernel_14164\703748539.py:1: SyntaxWarning: invalid escape sequence '\d'
  empc["Age"] = emp["Age"].str.extract('(\d+)')

In [39]:
empc

     Name          Domain  Age   Location   Salary      Exp
0    Mike   Datascience#$   34     Mumbai   5^00#0       2+
1  Teddy^         Testing   45  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#  NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics  NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67        NaN   30000-  5+ year
5     Kim             NLP   55      Delhi  6000^$0      10+

In [42]:
empc["Name"] = emp["Name"].str.extract('(\w+)')
empc

<>:1: SyntaxWarning: invalid escape sequence '\w'
<>:1: SyntaxWarning: invalid escape sequence '\w'
C:\Users\vineet\AppData\Local\Temp\ipykernel_14164\2542707926.py:1: SyntaxWarning: invalid escape sequence '\w'
  empc["Name"] = emp["Name"].str.extract('(\w+)')

    Name          Domain  Age   Location   Salary      Exp
0   Mike   Datascience#$   34     Mumbai   5^00#0       2+
1  Teddy         Testing   45  Bangalore  10%%000       <3
2   Umar  Dataanalyst^^#  NaN        NaN  1$5%000   4> yrs
3   Jane     Ana^^lytics  NaN   Hyderbad   2000^0      NaN
4  Uttam      Statistics   67        NaN   30000-  5+ year
5    Kim             NLP   55      Delhi  6000^$0      10+

In [43]:
empc["Salary"] = emp["Salary"].str.extract('(\d+)')
empc

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\vineet\AppData\Local\Temp\ipykernel_14164\2731225273.py:1: SyntaxWarning: invalid escape sequence '\d'
  empc["Salary"] = emp["Salary"].str.extract('(\d+)')

    Name          Domain  Age   Location Salary      Exp
0   Mike   Datascience#$   34     Mumbai   5000       2+
1  Teddy         Testing   45  Bangalore  10000       <3
2   Umar  Dataanalyst^^#  NaN        NaN  15000   4> yrs
3   Jane     Ana^^lytics  NaN   Hyderbad  20000      NaN
4  Uttam      Statistics   67        NaN  30000  5+ year
5    Kim             NLP   55      Delhi  60000      10+

In [54]:
#No plus sign inside extract

empc["Exp"] = emp["Exp"].str.extract('(\d)')
empc

<>:3: SyntaxWarning: invalid escape sequence '\d'
<>:3: SyntaxWarning: invalid escape sequence '\d'
C:\Users\vineet\AppData\Local\Temp\ipykernel_14164\610644184.py:3: SyntaxWarning: invalid escape sequence '\d'
  empc["Exp"] = emp["Exp"].str.extract('(\d)')

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000    1

In [ ]:
#Use r, and no warning, no plus sign only first letter of Domain
empc["Domain"] = emp["Domain"].str.extract(r'(\w)')
empc

    Name Domain  Age   Location Salary Exp
0   Mike      D   34     Mumbai   5000   5
1  Teddy      T   45  Bangalore  10000   1
2   Umar      D  NaN        NaN  15000   1
3   Jane      A  NaN   Hyderbad  20000   2
4  Uttam      S   67        NaN  30000   3
5    Kim      N   55      Delhi  60000   6

In [56]:
empc["Domain"] = emp["Domain"].str.extract(r'(\w+)')
empc

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000    1

In [ ]:
emp == empc

#Both gave same output, False for none values

   Name  Domain    Age  Location  Salary    Exp
0  True    True   True      True    True   True
1  True    True   True      True    True   True
2  True    True  False     False    True   True
3  True    True  False      True    True  False
4  True    True   True     False    True   True
5  True    True   True      True    True  False

In [59]:
emp.Age.dtype, empc.Age.dtype

(dtype('O'), dtype('O'))

In [60]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

<p style="text-align:center;font-size:1.5em;">Missing Value Treatment</p>

In [61]:
import numpy as np

In [65]:
emp["Age"] = emp["Age"].fillna(np.mean(pd.to_numeric(emp["Age"])))
emp

    Name       Domain    Age   Location Salary  Exp
0   Mike  Datascience     34     Mumbai   5000    2
1  Teddy      Testing     45  Bangalore  10000    3
2   Umar  Dataanalyst  50.25        NaN  15000    4
3   Jane    Analytics  50.25   Hyderbad  20000  NaN
4  Uttam   Statistics     67        NaN  30000    5
5    Kim          NLP     55      Delhi  60000   10

In [67]:
emp["Exp"] = emp["Exp"].fillna(np.mean(pd.to_numeric(emp["Exp"])))
emp

    Name       Domain    Age   Location Salary  Exp
0   Mike  Datascience     34     Mumbai   5000    2
1  Teddy      Testing     45  Bangalore  10000    3
2   Umar  Dataanalyst  50.25        NaN  15000    4
3   Jane    Analytics  50.25   Hyderbad  20000  4.8
4  Uttam   Statistics     67        NaN  30000    5
5    Kim          NLP     55      Delhi  60000   10

In [ ]:
emp["Location"] = emp["Location"].fillna(emp["Location"].mode()[0])
emp

#What happened here??
#The zero is important when you fill categorical data

    Name       Domain    Age   Location Salary  Exp
0   Mike  Datascience     34     Mumbai   5000    2
1  Teddy      Testing     45  Bangalore  10000    3
2   Umar  Dataanalyst  50.25  Bangalore  15000    4
3   Jane    Analytics  50.25   Hyderbad  20000  4.8
4  Uttam   Statistics     67  Bangalore  30000    5
5    Kim          NLP     55      Delhi  60000   10

In [71]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      object
 3   Location  6 non-null      object
 4   Salary    6 non-null      object
 5   Exp       6 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [72]:
emp.Age.dtype

dtype('O')

In [ ]:
emp.Age = emp.Age.astype(int)

In [74]:
emp.Exp = emp.Exp.astype(int)

In [77]:
emp.Salary = emp.Salary.astype(int)

In [78]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      int64
 3   Location  6 non-null      object
 4   Salary    6 non-null      int64
 5   Exp       6 non-null      int64
dtypes: int64(3), object(3)
memory usage: 420.0+ bytes

In [82]:
#Converting String to Categorical Data

emp.Name = emp.Name.astype("category")
emp.Domain = emp.Domain.astype("category")
emp.Location = emp.Location.astype("category")

emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      category
 1   Domain    6 non-null      category
 2   Age       6 non-null      int64
 3   Location  6 non-null      category
 4   Salary    6 non-null      int64
 5   Exp       6 non-null      int64
dtypes: category(3), int64(3)
memory usage: 938.0 bytes